[
	{
		"title": "Law Clerk for the Gang Crimes Unit",
		"company": "Cook County State's Attorney's Office",
		"location": "Chicago, IL",
		"dates": "June 2019 to September 2019",
		"tasks": [
			"Conduct legal research and compose memorandum related to issues that unit attorneys present for review.",
			"Assist attorneys in court by consulting on legal issues."
		],
		"img": "images/ccsa-seal.png"
	},
	{
		"title": "Teaching Assistant for CS 106",
		"company": "Stanford University",
		"location": "Stanford, CA",
		"dates": "March 2019 to present",
		"tasks": [
			"Teach a group of ~10 students in a discussion section for the introductory computer science class at Stanford, one of the largest undergraduate classes at the university.",
			"Grade weekly assignments for the class."
		],
		"img": "images/stanford-logo.png"
	},
	{
		"title": "Intern",
		"company": "Office of the District Attorney of Brazos County",
		"location": "Bryan, TX",
		"dates": "May 2018 to September 2018",
		"tasks": [
			"Conducted a statistical analysis of crime in Brazos County by implementing machine learning algorithms in Python to analyze big data sets. The analysis improved the office policy regarding domestic violence and burglary cases.",
			"Reviewed numerous of cases during the intake phase to determine whether they should be presented to a Grand Jury for indictment by looking for constitutional violations by officers and other issues.",
			"Assisted with jury selection in five cases in district courts in Brazos County.",
			"Visited witnesses and took notes on their planned testimony."
		],
		"img": "images/brazos-seal.png"
	},
	{
		"title": "Undergraduate Researcher",
		"company": "Texas A&amp;M University",
		"location": "College Station, TX",
		"dates": "January 2017 to June 2018",
		"description": "Worked under <a href=\"http://math.tamu.edu/~jml\">Dr. J. M. Landsberg</a> on a problem that lies at the intersection of algebraic geometry and combinatorics. The project studies the geometry of tensor networks. This is a question which has applications in quantum information theory and computer science.<br> See the paper I wrote at <a href=\"https://arxiv.org/abs/1806.03567\">https://arxiv.org/abs/1806.03567</a>.",
		"img": "images/tam-logo.png"
	},
	{
		"title": "Chief Web Designer",
		"company": "Maplets for Calculus",
		"location": "College Station, TX",
		"dates": "2014 to 2017",
		"tasks": [
			"Designed and wrote eight “maplets” to change the pedagogical process by which Calculus is often taught (a maplet is a computer applet written in Maple).",
			"Created database structures and algorithms to surround the maplet architecture. Created a maplet rating page powered by the Symfony (PHP) framework."
		],
		"description": "Grant: NSF DUE CCLI / TUES Grant 0737209 / 1123255 (Awarded to Dr. Philip B. Yasskin)"
	}
]